UNF_KlK.КИТ_ДОК/src/Catalogs/Пакеты/Пакеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пакеты</name>
  <attributes>
    <name>ДатаПакета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияПроизводства</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.СменыПроизводства</types>
    </type>
  </attributes>
  <attributes>
    <name>Стандарт</name>
    <type>
      <types>CatalogRef.Стандарты</types>
    </type>
  </attributes>
  <attributes>
    <name>Толщина</name>
    <type>
      <types>CatalogRef.Толщины</types>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>CatalogRef.Ширины</types>
    </type>
  </attributes>
  <attributes>
    <name>Длина</name>
    <type>
      <types>CatalogRef.Длины</types>
    </type>
  </attributes>
  <attributes>
    <name>Влажность</name>
    <type>
      <types>CatalogRef.ЗначенияСвойствОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДосок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СерияНоменклатуры</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Учетчик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПакета</name>
    <type>
      <types>EnumRef.ВидыПакетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Несертифицированный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

UNF_KlK.КИТ_ДОК/src/Catalogs/Пакеты/ObjectModule.bsl
Перем ПорядковыйНомерПоСмене экспорт;

Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	Префикс = ""+Подразделение.НомерОрганизации+Подразделение.НомерПодразделения;
КонецПроцедуры



Процедура ПередЗаписью(Отказ)
	Наименование =  Код+";"+Номенклатура+";"+ХарактеристикаНоменклатуры+";"+ДатаПакета;
КонецПроцедуры


Функция ВычислитьКодПакета(ПорядковыйНомерПоСмене)
	НомерПакета ="";		
	Если НачалоГода(ДатаПакета)  >= Дата('20210101') Тогда
		НомерПакета = Подразделение.НомерОрганизации+Подразделение.НомерПодразделения+ Прав(Год(ДатаПакета),2) + Строка(Формат(Смена.НомерСмены,"ЧЦ=2")) + Формат(ПорядковыйНомерПоСмене, "ЧЦ=5; ЧВН=; ЧГ=0");	
	Иначе
	    НомерПакета = Подразделение.НомерОрганизации+Подразделение.НомерПодразделения+ Прав(Год(ДатаПакета),1) + Строка(Формат(Смена.НомерСмены,"ЧЦ=2")) + Формат(ПорядковыйНомерПоСмене, "ЧЦ=5; ЧВН=; ЧГ=0");	
	КонецЕсли;

	//НомерПакета = Подразделение.НомерОрганизации+Подразделение.НомерПодразделения+ Прав(Год(ДатаПакета),2) + Строка(Формат(Смена.НомерСмены,"ЧЦ=2")) + Формат(ПорядковыйНомерПоСмене, "ЧЦ=5; ЧВН=; ЧГ=0");	
	
	Возврат НомерПакета;
	
КонецФункции

//Поиск серии и создание. Связка Номенклатура + Характеристика + Серия
Функция НайтиСериюНоменклатуры(КодСерии,НоменклатураСерии) Экспорт
	СерияПакета = Справочники.СерииНоменклатуры.ПустаяСсылка();
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СерииНоменклатуры.Ссылка КАК СЕРИЯ
		|ИЗ
		|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
		|ГДЕ
		|	СерииНоменклатуры.СерийныйНомер = &СерийныйНомер";

	Запрос.УстановитьПараметр("СерийныйНомер", КодСерии);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СерияПакета = ВыборкаДетальныеЗаписи.СЕРИЯ;		
	КонецЦикла;

	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	Если Не ЗначениеЗаполнено(СерияПакета) Тогда
		
		СерияПакетОбъект = Справочники.СерииНоменклатуры.СоздатьЭлемент();
		СерияПакетОбъект.Владелец = НоменклатураСерии;
		СерияПакетОбъект.Наименование = КодСерии;
		СерияПакетОбъект.СерийныйНомер = КодСерии;
		СерияПакетОбъект.Записать();
		СерияПакета = СерияПакетОбъект.Ссылка;
		
	КонецЕсли;
	
	Возврат СерияПакета;
	
КонецФункции

Процедура ЗаписатьПакет(Отказ) Экспорт
	Наименование = Код+";"+Номенклатура+";"+ХарактеристикаНоменклатуры+";"+ДатаПакета;
	Номенклатура = Стандарт.Номенклатура;
	//ХарактеристикаНоменклатуры = НайтиХарактеристику(Номенклатура,Отказ,Истина);
	СерияНоменклатуры = НайтиСериюНоменклатуры(Код,Номенклатура);
КонецПроцедуры	

Процедура ПриКопировании(ОбъектКопирования)
	СерияНоменклатуры = Справочники.СерииНоменклатуры.ПустаяСсылка();
КонецПроцедуры
